InformationRegisters/СостоянияСинхронизацииСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСинхронизацииСЦентромЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеткаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииСЦентромЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияСинхронизацииОбъектовСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСинхронизацииОбъектовСЦентромЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеткаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСинхронизацииСЦентромЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЦентраЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЦентровЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяЗавершитьПереходВЦентрЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСинхронизацииСЦентромЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСинхронизацииСЦентромЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетныеЗаписиЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеДокументовЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусыДоверенностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныеКонтейнерыЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СостоянияСинхронизацииСЦентромЭДО/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ТолькоИзменение Тогда
		ТолькоИзменение = Истина;
		Элементы.Список.ИзменятьСоставСтрок = Ложь;
		Элементы.Список.ИзменятьПорядокСтрок = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ИдентификаторыЭДО) Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторЭДО");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение = Параметры.ИдентификаторыЭДО;
	КонецЕсли;
	
	Если Параметры.ПолучатьДанныеИзСервиса Тогда
		ПолучатьДанныеИзСервиса = Истина;
		Элементы.МеткаВремениВЦентреЭДО.Видимость = Истина;
		Элементы.ФормаПолучитьИзОблака.Видимость = Истина;
		Элементы.СписокКонтекстноеМенюПолучитьИзОблака.Видимость = Истина;
		Элементы.Список.УстановитьДействие("ПриПолученииДанныхНаСервере",
			"Подключаемый_СписокПриПолученииДанныхНаСервере");
	Иначе
		Элементы.МеткаВремениВЦентреЭДО.Видимость = Ложь;
		Элементы.ФормаПолучитьИзОблака.Видимость = Ложь;
		Элементы.СписокКонтекстноеМенюПолучитьИзОблака.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если Поле = Элементы.ТипСинхронизации Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторЭДО", ТекущиеДанные.ИдентификаторЭДО);
		Отбор.Вставить("ТипДанных", ТекущиеДанные.ТипСинхронизации);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("ТолькоИзменение", ТолькоИзменение);
		ПараметрыФормы.Вставить("ПолучатьДанныеИзСервиса", ПолучатьДанныеИзСервиса);
		ОткрытьФорму("РегистрСведений.СостоянияСинхронизацииОбъектовСЦентромЭДО.ФормаСписка",
			ПараметрыФормы, ЭтотОбъект);
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока);
		ПараметрыФормы.Вставить("ТолькоИзменение", ТолькоИзменение);
		Если ТекущиеДанные.Свойство("МеткаВремениВЦентреЭДО") Тогда
			ПараметрыФормы.Вставить("МеткаВремениВЦентреЭДО", ТекущиеДанные.МеткаВремениВЦентреЭДО);
		КонецЕсли;
		ОткрытьФорму("РегистрСведений.СостоянияСинхронизацииСЦентромЭДО.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Подключаемый_СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	СтрокиДляЗаполненияДанных = Новый ТаблицаЗначений();
	СтрокиДляЗаполненияДанных.Колонки.Добавить("ИдентификаторЭДО", ОбщегоНазначения.ОписаниеТипаСтрока(70));
	СтрокиДляЗаполненияДанных.Колонки.Добавить("ТипСинхронизации",
		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО"));
	СтрокиДляЗаполненияДанных.Колонки.Добавить("Значение",
		Новый ОписаниеТипов("Неопределено, СтрокаДинамическогоСписка"));
	
	Для Каждого СтрокаСписка Из Строки Цикл
		ДанныеСтроки = СтрокаСписка.Значение.Данные;
		СтрокаДляЗаполненияДанных = СтрокиДляЗаполненияДанных.Добавить();
		СтрокаДляЗаполненияДанных.ИдентификаторЭДО = ДанныеСтроки.ИдентификаторЭДО;
		СтрокаДляЗаполненияДанных.ТипСинхронизации = ДанныеСтроки.ТипСинхронизации;
		СтрокаДляЗаполненияДанных.Значение = СтрокаСписка.Значение;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(СтрокиДляЗаполненияДанных) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыЭДО = ОбщегоНазначения.ВыгрузитьКолонку(СтрокиДляЗаполненияДанных, "ИдентификаторЭДО", Истина);
	
	ИдентификаторыЭДОПоУчетнымЗаписям = РегистрыСведений.НастройкиИнтеграцииЦентраЭДО.СгруппироватьПоУчетнымЗаписям(
		ИдентификаторыЭДО);
	
	Для Каждого ИдентификаторыЭДОПоУчетнойЗаписи Из ИдентификаторыЭДОПоУчетнымЗаписям Цикл
		
		УчетнаяЗаписьЦентраЭДО = ИдентификаторыЭДОПоУчетнойЗаписи.Ключ;
		ИдентификаторыЭДО = ИдентификаторыЭДОПоУчетнойЗаписи.Значение;
		
		ПараметрыВыполнения = ИнтеграцияЦентраЭДО.ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО);
		
		ПакетМетодов = ПакетМетодовСервиса(СтрокиДляЗаполненияДанных, ИдентификаторыЭДО);
		
		РезультатыМетодов = ИнтеграцияЦентраЭДО.ВыполнитьПакетМетодовСервиса(ПараметрыВыполнения, ПакетМетодов);
		
		ЗаполнитьСтрокиСписка(СтрокиДляЗаполненияДанных, РезультатыМетодов);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьИзОблака(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ПолучитьИзОблакаВФоне(ВыделенныеСтроки, УникальныйИдентификатор);
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьИзОблакаЗавершение", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СписокПриПолученииДанных

// Параметры:
//  СтрокиДляЗаполненияДанных - ТаблицаЗначений:
//  * ИдентификаторЭДО - Строка
//  * ТипСинхронизации - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  * Значение - Неопределено,СтрокаДинамическогоСписка
//  ИдентификаторыЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  См. ИнтеграцияЦентраЭДО.НовыйПакетМетодовСервиса
&НаСервереБезКонтекста
Функция ПакетМетодовСервиса(СтрокиДляЗаполненияДанных, ИдентификаторыЭДО)
	
	ПакетМетодов = ИнтеграцияЦентраЭДО.НовыйПакетМетодовСервиса();
	
	ИдентификаторыЭДОПоТипамСинхронизации = Новый Соответствие;
	Для Каждого СтрокаДляЗаполненияДанных Из СтрокиДляЗаполненияДанных Цикл
		Если ИдентификаторыЭДО.Найти(СтрокаДляЗаполненияДанных.ИдентификаторЭДО) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ИдентификаторыЭДОТипаСинхронизации = ИдентификаторыЭДОПоТипамСинхронизации[
			СтрокаДляЗаполненияДанных.ТипСинхронизации];
		Если ИдентификаторыЭДОТипаСинхронизации = Неопределено Тогда
			ИдентификаторыЭДОТипаСинхронизации = Новый Массив; // Массив из Строка
			ИдентификаторыЭДОПоТипамСинхронизации.Вставить(СтрокаДляЗаполненияДанных.ТипСинхронизации,
				ИдентификаторыЭДОТипаСинхронизации);
		КонецЕсли;
		ИдентификаторыЭДОТипаСинхронизации.Добавить(СтрокаДляЗаполненияДанных.ИдентификаторЭДО);
	КонецЦикла;
	
	Для Каждого ИдентификаторыЭДОПоТипуСинхронизации Из ИдентификаторыЭДОПоТипамСинхронизации Цикл
		
		ТипСинхронизации = ИдентификаторыЭДОПоТипуСинхронизации.Ключ;
		ИдентификаторыЭДОТипаСинхронизации = ИдентификаторыЭДОПоТипуСинхронизации.Значение;
		
		Если ТипСинхронизации = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
				"ПоследниеМеткиВремениДокументовЭДО", ИдентификаторыЭДОТипаСинхронизации);
			ИдентификаторМетода = ИдентификаторМетодаПоследниеМеткиВремениДокументовЭДО();
		ИначеЕсли ТипСинхронизации = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
				"ПоследниеМеткиВремениПолныхДанныхДокументовЭДО", ИдентификаторыЭДОТипаСинхронизации);
			ИдентификаторМетода = ИдентификаторМетодаПоследниеМеткиВремениПолныхДанныхДокументовЭДО();
		ИначеЕсли ТипСинхронизации = Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
				"ПоследниеМеткиВремениПриглашенийЭДО", ИдентификаторыЭДОТипаСинхронизации);
			ИдентификаторМетода = ИдентификаторМетодаПоследниеМеткиВремениПриглашенийЭДО();
		ИначеЕсли ТипСинхронизации = Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО Тогда
			ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
				"МеткиВремениУчетныхЗаписейЭДО", ИдентификаторыЭДОТипаСинхронизации);
			ИдентификаторМетода = ИдентификаторМетодаМеткиВремениУчетныхЗаписейЭДО();
		Иначе
			Продолжить;
		КонецЕсли;
		
		ИнтеграцияЦентраЭДО.ДобавитьОписаниеМетодаВПакет(ПакетМетодов, ОписаниеМетода, ИдентификаторМетода);
		
	КонецЦикла;
	
	Возврат ПакетМетодов;
	
КонецФункции

// Параметры:
//  СтрокиДляЗаполненияДанных - см. ПакетМетодовСервиса.СтрокиДляЗаполненияДанных
//  РезультатыМетодов - см. ИнтеграцияЦентраЭДО.ВыполнитьПакетМетодовСервиса
&НаСервереБезКонтекста
Процедура ЗаполнитьСтрокиСписка(СтрокиДляЗаполненияДанных, РезультатыМетодов)
	
	Если Не ЗначениеЗаполнено(РезультатыМетодов) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого РезультатМетодаПакета Из РезультатыМетодов Цикл
		
		ИдентификаторМетода = РезультатМетодаПакета.Ключ;
		РезультатМетода = РезультатМетодаПакета.Значение;
		
		Если ИдентификаторМетода = ИдентификаторМетодаПоследниеМеткиВремениДокументовЭДО() Тогда
			
			ЗаполнитьСтрокиСпискаПоТипуСинхронизации(СтрокиДляЗаполненияДанных, РезультатМетода,
				Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО);
			
		ИначеЕсли ИдентификаторМетода = ИдентификаторМетодаПоследниеМеткиВремениПолныхДанныхДокументовЭДО() Тогда
			
			ЗаполнитьСтрокиСпискаПоТипуСинхронизации(СтрокиДляЗаполненияДанных, РезультатМетода,
				Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО);
			
		ИначеЕсли ИдентификаторМетода = ИдентификаторМетодаПоследниеМеткиВремениПриглашенийЭДО() Тогда
			
			ЗаполнитьСтрокиСпискаПоТипуСинхронизации(СтрокиДляЗаполненияДанных, РезультатМетода,
				Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО);
			
		ИначеЕсли ИдентификаторМетода = ИдентификаторМетодаМеткиВремениУчетныхЗаписейЭДО() Тогда
			
			ЗаполнитьСтрокиСпискаПоТипуСинхронизации(СтрокиДляЗаполненияДанных, РезультатМетода,
				Перечисления.ТипыСинхронизацииСЦентромЭДО.УчетныеЗаписиЭДО);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  СтрокиДляЗаполненияДанных - см. ПакетМетодовСервиса.СтрокиДляЗаполненияДанных
//  ПоследниеМеткиВремени - Массив из Структура:
//  * ИдентификаторЭДО - Строка
//  * МеткаВремени - Число
//  ТипСинхронизации - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
&НаСервереБезКонтекста
Процедура ЗаполнитьСтрокиСпискаПоТипуСинхронизации(СтрокиДляЗаполненияДанных, ПоследниеМеткиВремени, ТипСинхронизации)
	
	Если Не ЗначениеЗаполнено(ПоследниеМеткиВремени) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИдентификаторЭДО, ТипСинхронизации", "", ТипСинхронизации);
	
	Для Каждого ПоследняяМеткаВремени Из ПоследниеМеткиВремени Цикл
		
		Отбор.ИдентификаторЭДО = ПоследняяМеткаВремени.ИдентификаторЭДО;
		НайденныеСтроки = СтрокиДляЗаполненияДанных.НайтиСтроки(Отбор);
		Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСписка = НайденныеСтроки[0].Значение; // СтрокаДинамическогоСписка
		
		ДанныеСтроки = СтрокаСписка.Данные;
		ДанныеСтроки.МеткаВремениВЦентреЭДО = ПоследняяМеткаВремени.МеткаВремени;
		
		ОформлениеЯчейки = СтрокаСписка.Оформление["МеткаВремениВЦентреЭДО"];
		ПредставлениеМеткиВремени = ОбщегоНазначенияБЭДКлиентСервер.ПредставлениеДатыВМиллисекундах(
			ПоследняяМеткаВремени.МеткаВремени);
		ОформлениеЯчейки.УстановитьЗначениеПараметра("Текст", ПредставлениеМеткиВремени);
		
		Если ДанныеСтроки.МеткаВремени <> ДанныеСтроки.МеткаВремениВЦентреЭДО Тогда
			ОформлениеЯчейки = СтрокаСписка.Оформление["МеткаВремени"];
			ОформлениеЯчейки.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаВниманиеБЭД);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращаемое значение:
//  Строка
&НаСервереБезКонтекста
Функция ИдентификаторМетодаПоследниеМеткиВремениДокументовЭДО()
	Возврат "ДокументыЭДО";
КонецФункции

// Возвращаемое значение:
//  Строка
&НаСервереБезКонтекста
Функция ИдентификаторМетодаПоследниеМеткиВремениПолныхДанныхДокументовЭДО()
	Возврат "ДанныеДокументовЭДО";
КонецФункции

// Возвращаемое значение:
//  Строка
&НаСервереБезКонтекста
Функция ИдентификаторМетодаПоследниеМеткиВремениПриглашенийЭДО()
	Возврат "ПриглашенияЭДО";
КонецФункции

// Возвращаемое значение:
//  Строка
&НаСервереБезКонтекста
Функция ИдентификаторМетодаМеткиВремениУчетныхЗаписейЭДО()
	Возврат "УчетныеЗаписиЭДО";
КонецФункции

#КонецОбласти

#Область ПолучитьИзОблака

// Параметры:
//  ТипыДанныхДляСинхронизации - Массив из РегистрСведенийКлючЗаписи.СостоянияСинхронизацииСЦентромЭДО
//  ИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. ДлительныеОперации.ВыполнитьФункцию
&НаСервереБезКонтекста
Функция ПолучитьИзОблакаВФоне(Знач ТипыДанныхДляСинхронизации, Знач ИдентификаторФормы)
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	// См. РегистрыСведений.СостоянияСинхронизацииСЦентромЭДО.ПолучитьОбъектыИзСервиса
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"РегистрыСведений.СостоянияСинхронизацииСЦентромЭДО.ПолучитьОбъектыИзСервиса",
		ТипыДанныхДляСинхронизации);
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - см. ДлительныеОперации.ВыполнитьФункцию
//  Контекст - Неопределено
&НаКлиенте
Процедура ПолучитьИзОблакаЗавершение(ДлительнаяОперация, Контекст = Неопределено) Экспорт
	
	ВидОперации = НСтр("ru = 'Получение объектов из центра ЭДО'");
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	РезультатПолучения = ОбщегоНазначенияБЭДКлиент.РезультатВыполненияФоновогоЗадания(
		ВидОперации, ДлительнаяОперация, КонтекстДиагностики); // См. РегистрыСведений.СостоянияСинхронизацииСЦентромЭДО.ПолучитьОбъектыИзСервиса
	
	Если Не ЗначениеЗаполнено(РезультатПолучения) Тогда
		ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(РезультатПолучения.КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
